[
  {
    "week": 1,
    "Data":[
      {
          "nutrient_id": "Vitamin-C",
          "need": [
                "It help mom maintain a healthy immune system",
                "It is required for mom’s body to make collagen to help baby’s skin, cartilage, tendons, and bone growth.",
                "It also acts as an antioxidant in the body, helps to prevent cell damage.",
                "It also helps your body absorb iron."
          ],
          "Dosage": [
                "Pregnant women ages 18 and younger: 80 milligrams (mg) per day",
                "Breastfeeding women ages 18 and younger: 115 mg per day",
                "Pregnant women ages 19 and older: 85 mg per day",
                "As high doses of vitamin C can upset your stomach and cause diarrhea and nausea"
          ],
          "Food": {
                "Fruit": {
                    "Oranges": {
                        "Oranges": ""
                    },
                    "Berries": {
                        "Berries": ""
                    },
                    "Mangoes": {
                        "Mangoes": ""
                    },
                    "Kiwi": {
                        "Kiwi": ""
                    },
                    "Strawberries": {
                        "Strawberries": ""
                    },
                    "Melons": {
                        "Melons": ""
                    },
                    "Tomato": {
                        "Tomato": ""
                    }
                ],
                "Vegetable":[
                    {
                        "name":"Orange",
                        "description":"",
                        "image":""
                    }
                },
                "Non-Veg": {},
                "Dairy": {},
                "Others": {}
          }
      },
      {
          "nutrient_id":"Iron",
          "need": [
                "Approximately half of mom’s iron intake will go toward the developing fetus and placenta. The other half will be used to help support mom’s increased blood volume."
          ],
          "Dosage": [
                "The average pregnant woman needs about 30 mg of elemental iron per day to meet the new demands of extra blood volume, the developing placenta, and growing fetus."
          ],
          "Food": {
                "Fruit": {
                    "Kiwi": {
                        "Kiwi": ""
                    }
                },
                "Vegetable": {},
                "Non-Veg": {
                    "Beef": {
                        "Beef": ""
                    },
                    "Poultry": {
                        "Poultry": ""
                    }
                },
                "Dairy": {},
                "Others": {
                    "Soy products": {
                        "Soy products": ""
                    },
                    "Dried-fruit": {
                        "Dried-fruit": ""
                    }
                }
          }
      },
      {
          "nutrient_id":"Fluid",
          "need": [
                "If your morning sickness is accompanied by cramps, fever or diarrhea, you may be dealing with a stomach bug or food poisoning rather than pregnancy nausea.",
                "But whether your stomach is churning from hormones, a virus or that egg salad you had for lunch, the treatment is the same: Rest up and focus on fluids — especially if you're losing them through vomiting or diarrhea."
          ],
          "Dosage": [
                "No Fixed Dosage"
          ],
          "Food": {
                "Drinking water": "",
                "Diluted juice": "",
                "Clear broth": "",
                "Weak decaffeinated tea or hot water with lemon": ""
          }
      },
      {  
        "nutrient_id":"Protein",
        "need": [
                "Protein helps your baby grow. The amino acids contained within protein are essential to healthy cell growth.",
                "Protein helps keep you healthy, too, and is important for the development of your own tissues."
        ],
        "Dosage": [
                "And as your belly increases in size to grow a healthy baby, your protein requirement also increases, especially during your second and third trimesters, when baby grows rapidly.",
                "In first trimester, eat three servings of protein daily to help spur new tissue for your baby-to-be."
        ],
        "Food": {
                "Fruit": {},
                "Vegetable": {},
                "Non-Veg": {
                    "Beef": {
                        "Beef": ""
                    },
                    "Poultry": {
                        "Poultry": ""
                    },
                    "Eggs": {
                        "Eggs": ""
                    }
                },
                "Dairy": {},
                "Others": {
                    "Nuts and seeds": {
                        "Nuts and seeds": ""
                    },
                    "Whole grains": {
                        "Whole grains": ""
                    }
                }
        }
      },
      {
          "nutrient_id":"Calcium",
          "need": [
                "Calcium helps you and your developing baby build and maintain strong, healthy bones",
                "Plus It's essential for heart, nerve and muscle health.",
                "If you don’t consume enough calcium during pregnancy, your baby will take it from your bones!"
          ],
          "Dosage": [
                "Your body can't make calcium, so you need to get it from food or supplements.",
                "While you're pregnant, try to get at least 1,000 mg of calcium every day.",
                "If you're 18 or younger, then you need at least 1,300 mg of calcium every day."
          ],
          "Food": {
                "Fruit": {},
                "Vegetable": {},
                "Non-Veg": {},
                "Dairy": {
                    "Yogurt": {
                        "Yogurt": ""
                    },
                    "Hard or pasteurized cheese": {
                        "Hard or pasteurized cheese": ""
                    }
                },
                "Others": {
                    "Calcium-fortified cereal": {
                        "Calcium-fortified cereal": ""
                    }
                }
          }
      }
    ]
  },
    
  "checkups_scans": [
      {
        "scan": [
          {
            "image": "",
            "title": "",
            "description": ""
          }
        ],
        "checkup": [
          {
            "image": "",
            "title": "",
            "description": ""
          }
        ],
        "vaccines": [
          {
            "image": "",
            "title": "",
            "description": ""
          }
        ]
      }
    ],
    "exercise": [
      {
        "image": "",
        "title": "",
        "description": ""
      }
    ],
    "tips": [
      {
        "title": "",
        "description": ""
      }
    ],
    "symptoms": [
      {
        "image": "",
        "title": "",
        "description": ""
      }
    ]
  }
]
